/******************************************************************************
  * @file    outsig.h
  * @author  Перминов Р.И.
  * @version v0.0.0.1
  * @date    28.09.2018
  *****************************************************************************/

#ifndef OUTSIG_H_  
#define OUTSIG_H_
  
  
#include "database.h"



/*! ------------------------------------------------------------------------------------------------------------------
 * @def: *_PERIOD
 *
 * @brief: Период ШИМ в мкс
 *
*/ 
#define SCREW_PERIOD  	1000000
#define FAN_PERIOD  	1000000



/*! ------------------------------------------------------------------------------------------------------------------
 * @fn: OutSig_Work
 *
 * @brief: Основной метод OutSig
 * 
 * input parameters
 * 
 * output parameters
 * 
 * no return
*/ 
extern void OutSig_Work(void); 



/*! ------------------------------------------------------------------------------------------------------------------
 * @fn: OutSig_Create
 *
 * @brief: Создание экземпляра OutSig
 * 
 * input parameters
 * 
 * output parameters
 * 
 * return 
 *		* 1 - провал
 *		* 0 - операция прошла успешно
*/  
extern int OutSig_Create(void); 
  
  
  
/*! ------------------------------------------------------------------------------------------------------------------
 * @fn: OutSig_Initialization
 *
 * @brief: Инициализация драйверов выходных сигналов
 * 
 * input parameters
 * pDB - указатель на базу параметров и сигналов
 * 
 * output parameters
 * 
 * return 
 *		* 1 - провал
 *		* 0 - операция прошла успешно
*/ 
extern int OutSig_Initialization(DB_t *pDB);  


#endif /* OUTSIG_H_ */